scmi011/input/SCMI011_P.xml

<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <ri:RecRefineryFF_NLOperation xmlns:ri="http://tempuri.org/">
      <rf:RefIntakeFF xmlns:rf="http://sww.shell.com/xsd/Shell/DS1/GSAP/refineryFF_NL">
        <Header>
          <RecordIdentifier>H</RecordIdentifier>
          <DataType>INPR</DataType>
          <Sender>NLOAS</Sender>
          <Country>NL</Country>
          <Location>PERNIS</Location>
          <PostingDate>20190131</PostingDate>
          <PostingTime>2359</PostingTime>
          <CumulativeQty>D</CumulativeQty>
          <PersontobeNotified>frank.heukelom@shell.com</PersontobeNotified>
          <Comment/>
          <DummyField/>
        </Header>
        <DetailGroup>
          <DetailRec>
            <RecordIdentifier>D</RecordIdentifier>
            <Plant>MOTP</Plant>
            <StorageLocation>0001</StorageLocation>
            <SAPMaterialNo>000000000210000450</SAPMaterialNo>
            <LegacyMaterialNo>03377</LegacyMaterialNo>
            <MaterialIndicator>I</MaterialIndicator>
            <Batch>UT</Batch>
            <Sign>-</Sign>
            <BaseQuantity>36681</BaseQuantity>
            <BaseUnitMeasurement>KG</BaseUnitMeasurement>
            <Temperature>15</Temperature>
            <TemperatureUnit>CEL</TemperatureUnit>
            <Density>1011.122</Density>
            <AirBuoyancyIndicator/>
            <CostCenter/>
            <ReasonCode/>
            <DummyField/>
          </DetailRec>
          <QuantityRec>
            <RecordIdentifier>Q</RecordIdentifier>
            <Quantity>36234.000</Quantity>
            <UnitofMeasurement>Litre@15</UnitofMeasurement>
            <DummyField/>
          </QuantityRec>
        </DetailGroup>
        <DetailGroup>
          <DetailRec>
            <RecordIdentifier>D</RecordIdentifier>
            <Plant>MOTP</Plant>
            <StorageLocation>0001</StorageLocation>
            <SAPMaterialNo>000000000210000083</SAPMaterialNo>
            <LegacyMaterialNo>03406</LegacyMaterialNo>
            <MaterialIndicator>I</MaterialIndicator>
            <Batch>UT</Batch>
            <Sign>+</Sign>
            <BaseQuantity>84118290</BaseQuantity>
            <BaseUnitMeasurement>KG</BaseUnitMeasurement>
            <Temperature>15</Temperature>
            <TemperatureUnit>CEL</TemperatureUnit>
            <Density>0</Density>
            <AirBuoyancyIndicator/>
            <CostCenter/>
            <ReasonCode/>
            <DummyField/>
          </DetailRec>
          <QuantityRec>
            <RecordIdentifier>Q</RecordIdentifier>
            <Quantity>99548285000.000</Quantity>
            <UnitofMeasurement>Litre@15</UnitofMeasurement>
            <DummyField/>
          </QuantityRec>
        </DetailGroup>
        <DetailGroup>
          <DetailRec>
            <RecordIdentifier>D</RecordIdentifier>
            <Plant>MOTP</Plant>
            <StorageLocation>0001</StorageLocation>
            <SAPMaterialNo>000000000210000075</SAPMaterialNo>
            <LegacyMaterialNo>03411</LegacyMaterialNo>
            <MaterialIndicator>I</MaterialIndicator>
            <Batch>UT</Batch>
            <Sign>-</Sign>
            <BaseQuantity>9672776</BaseQuantity>
            <BaseUnitMeasurement>KG</BaseUnitMeasurement>
            <Temperature>15</Temperature>
            <TemperatureUnit>CEL</TemperatureUnit>
            <Density>791.810</Density>
            <AirBuoyancyIndicator/>
            <CostCenter/>
            <ReasonCode/>
            <DummyField/>
          </DetailRec>
          <QuantityRec>
            <RecordIdentifier>Q</RecordIdentifier>
            <Quantity>12199035.000</Quantity>
            <UnitofMeasurement>Litre@15</UnitofMeasurement>
            <DummyField/>
          </QuantityRec>
        </DetailGroup>
        <DetailGroup>
          <DetailRec>
            <RecordIdentifier>D</RecordIdentifier>
            <Plant>MOTP</Plant>
            <StorageLocation>0001</StorageLocation>
            <SAPMaterialNo>000000000210000341</SAPMaterialNo>
            <LegacyMaterialNo>03420</LegacyMaterialNo>
            <MaterialIndicator>I</MaterialIndicator>
            <Batch>UT</Batch>
            <Sign>-</Sign>
            <BaseQuantity>16758578.000000002</BaseQuantity>
            <BaseUnitMeasurement>KG</BaseUnitMeasurement>
            <Temperature>15</Temperature>
            <TemperatureUnit>CEL</TemperatureUnit>
            <Density>871.551</Density>
            <AirBuoyancyIndicator/>
            <CostCenter/>
            <ReasonCode/>
            <DummyField/>
          </DetailRec>
          <QuantityRec>
            <RecordIdentifier>Q</RecordIdentifier>
            <Quantity>19204654.000</Quantity>
            <UnitofMeasurement>Litre@15</UnitofMeasurement>
            <DummyField/>
          </QuantityRec>
        </DetailGroup>
        <DetailGroup>
          <DetailRec>
            <RecordIdentifier>D</RecordIdentifier>
            <Plant>MOTP</Plant>
            <StorageLocation>0001</StorageLocation>
            <SAPMaterialNo>000000000210000246</SAPMaterialNo>
            <LegacyMaterialNo>03625</LegacyMaterialNo>
            <MaterialIndicator>I</MaterialIndicator>
            <Batch>UT</Batch>
            <Sign>+</Sign>
            <BaseQuantity>560793611</BaseQuantity>
            <BaseUnitMeasurement>KG</BaseUnitMeasurement>
            <Temperature>15</Temperature>
            <TemperatureUnit>CEL</TemperatureUnit>
            <Density>.138</Density>
            <AirBuoyancyIndicator/>
            <CostCenter/>
            <ReasonCode/>
            <DummyField/>
          </DetailRec>
          <QuantityRec>
            <RecordIdentifier>Q</RecordIdentifier>
            <Quantity>552801316566.000</Quantity>
            <UnitofMeasurement>Litre@15</UnitofMeasurement>
            <DummyField/>
          </QuantityRec>
        </DetailGroup>
        <DetailGroup>
          <DetailRec>
            <RecordIdentifier>D</RecordIdentifier>
            <Plant>MOTP</Plant>
            <StorageLocation>0001</StorageLocation>
            <SAPMaterialNo>000000000210000214</SAPMaterialNo>
            <LegacyMaterialNo>03630</LegacyMaterialNo>
            <MaterialIndicator>I</MaterialIndicator>
            <Batch>UT</Batch>
            <Sign>+</Sign>
            <BaseQuantity>294881084</BaseQuantity>
            <BaseUnitMeasurement>KG</BaseUnitMeasurement>
            <Temperature>15</Temperature>
            <TemperatureUnit>CEL</TemperatureUnit>
            <Density>.107</Density>
            <AirBuoyancyIndicator/>
            <CostCenter/>
            <ReasonCode/>
            <DummyField/>
          </DetailRec>
          <QuantityRec>
            <RecordIdentifier>Q</RecordIdentifier>
            <Quantity>301192630115.000</Quantity>
            <UnitofMeasurement>Litre@15</UnitofMeasurement>
            <DummyField/>
          </QuantityRec>
        </DetailGroup>
        <DetailGroup>
          <DetailRec>
            <RecordIdentifier>D</RecordIdentifier>
            <Plant>MOTP</Plant>
            <StorageLocation>0001</StorageLocation>
            <SAPMaterialNo>000000000210000021</SAPMaterialNo>
            <LegacyMaterialNo>03655</LegacyMaterialNo>
            <MaterialIndicator>I</MaterialIndicator>
            <Batch>UT</Batch>
            <Sign>+</Sign>
            <BaseQuantity>70816</BaseQuantity>
            <BaseUnitMeasurement>KG</BaseUnitMeasurement>
            <Temperature>15</Temperature>
            <TemperatureUnit>CEL</TemperatureUnit>
            <Density>734.971</Density>
            <AirBuoyancyIndicator/>
            <CostCenter/>
            <ReasonCode/>
            <DummyField/>
          </DetailRec>
          <QuantityRec>
            <RecordIdentifier>Q</RecordIdentifier>
            <Quantity>96231.000</Quantity>
            <UnitofMeasurement>Litre@15</UnitofMeasurement>
            <DummyField/>
          </QuantityRec>
        </DetailGroup>
        <DetailGroup>
          <DetailRec>
            <RecordIdentifier>D</RecordIdentifier>
            <Plant>MOTP</Plant>
            <StorageLocation>0001</StorageLocation>
            <SAPMaterialNo>000000000210001040</SAPMaterialNo>
            <LegacyMaterialNo>03741</LegacyMaterialNo>
            <MaterialIndicator>I</MaterialIndicator>
            <Batch>UT</Batch>
            <Sign>+</Sign>
            <BaseQuantity>105921413</BaseQuantity>
            <BaseUnitMeasurement>KG</BaseUnitMeasurement>
            <Temperature>15</Temperature>
            <TemperatureUnit>CEL</TemperatureUnit>
            <Density>8.746</Density>
            <AirBuoyancyIndicator/>
            <CostCenter/>
            <ReasonCode/>
            <DummyField/>
          </DetailRec>
          <QuantityRec>
            <RecordIdentifier>Q</RecordIdentifier>
            <Quantity>136729273.000</Quantity>
            <UnitofMeasurement>Litre@15</UnitofMeasurement>
            <DummyField/>
          </QuantityRec>
        </DetailGroup>
        <DetailGroup>
          <DetailRec>
            <RecordIdentifier>D</RecordIdentifier>
            <Plant>MOTP</Plant>
            <StorageLocation>0001</StorageLocation>
            <SAPMaterialNo>000000000210001701</SAPMaterialNo>
            <LegacyMaterialNo>03766</LegacyMaterialNo>
            <MaterialIndicator>I</MaterialIndicator>
            <Batch>UT</Batch>
            <Sign>+</Sign>
            <BaseQuantity>76395699</BaseQuantity>
            <BaseUnitMeasurement>KG</BaseUnitMeasurement>
            <Temperature>15</Temperature>
            <TemperatureUnit>CEL</TemperatureUnit>
            <Density>.009</Density>
            <AirBuoyancyIndicator/>
            <CostCenter/>
            <ReasonCode/>
            <DummyField/>
          </DetailRec>
          <QuantityRec>
            <RecordIdentifier>Q</RecordIdentifier>
            <Quantity>99937017565.000</Quantity>
            <UnitofMeasurement>Litre@15</UnitofMeasurement>
            <DummyField/>
          </QuantityRec>
        </DetailGroup>
        <DetailGroup>
          <DetailRec>
            <RecordIdentifier>D</RecordIdentifier>
            <Plant>MOTP</Plant>
            <StorageLocation>0001</StorageLocation>
            <SAPMaterialNo>000000000210001820</SAPMaterialNo>
            <LegacyMaterialNo>03772</LegacyMaterialNo>
            <MaterialIndicator>I</MaterialIndicator>
            <Batch>UT</Batch>
            <Sign>+</Sign>
            <BaseQuantity>100195620</BaseQuantity>
            <BaseUnitMeasurement>KG</BaseUnitMeasurement>
            <Temperature>15</Temperature>
            <TemperatureUnit>CEL</TemperatureUnit>
            <Density>.000</Density>
            <AirBuoyancyIndicator/>
            <CostCenter/>
            <ReasonCode/>
            <DummyField/>
          </DetailRec>
          <QuantityRec>
            <RecordIdentifier>Q</RecordIdentifier>
            <Quantity>109981471846.000</Quantity>
            <UnitofMeasurement>Litre@15</UnitofMeasurement>
            <DummyField/>
          </QuantityRec>
        </DetailGroup>
        <DetailGroup>
          <DetailRec>
            <RecordIdentifier>D</RecordIdentifier>
            <Plant>MOTP</Plant>
            <StorageLocation>0001</StorageLocation>
            <SAPMaterialNo>000000000210002060</SAPMaterialNo>
            <LegacyMaterialNo>03782</LegacyMaterialNo>
            <MaterialIndicator>I</MaterialIndicator>
            <Batch>UT</Batch>
            <Sign>+</Sign>
            <BaseQuantity>89454382</BaseQuantity>
            <BaseUnitMeasurement>KG</BaseUnitMeasurement>
            <Temperature>15</Temperature>
            <TemperatureUnit>CEL</TemperatureUnit>
            <Density>0</Density>
            <AirBuoyancyIndicator/>
            <CostCenter/>
            <ReasonCode/>
            <DummyField/>
          </DetailRec>
          <QuantityRec>
            <RecordIdentifier>Q</RecordIdentifier>
            <Quantity>108151173000.000</Quantity>
            <UnitofMeasurement>Litre@15</UnitofMeasurement>
            <DummyField/>
          </QuantityRec>
        </DetailGroup>
        <DetailGroup>
          <DetailRec>
            <RecordIdentifier>D</RecordIdentifier>
            <Plant>MOTP</Plant>
            <StorageLocation>0001</StorageLocation>
            <SAPMaterialNo>LOSS</SAPMaterialNo>
            <LegacyMaterialNo/>
            <MaterialIndicator>L</MaterialIndicator>
            <Batch>UT</Batch>
            <Sign>+</Sign>
            <BaseQuantity>1285362880</BaseQuantity>
            <BaseUnitMeasurement>KG</BaseUnitMeasurement>
            <Temperature/>
            <TemperatureUnit/>
            <Density/>
            <AirBuoyancyIndicator/>
            <CostCenter/>
            <ReasonCode>50</ReasonCode>
            <DummyField/>
          </DetailRec>
        </DetailGroup>
        <DetailGroup>
          <DetailRec>
            <RecordIdentifier>D</RecordIdentifier>
            <Plant>MOTP</Plant>
            <StorageLocation>0001</StorageLocation>
            <SAPMaterialNo>LOSS</SAPMaterialNo>
            <LegacyMaterialNo/>
            <MaterialIndicator>P</MaterialIndicator>
            <Batch>UT</Batch>
            <Sign>+</Sign>
            <BaseQuantity>1285362880</BaseQuantity>
            <BaseUnitMeasurement>KG</BaseUnitMeasurement>
            <Temperature/>
            <TemperatureUnit/>
            <Density/>
            <AirBuoyancyIndicator/>
            <CostCenter/>
            <ReasonCode/>
            <DummyField/>
          </DetailRec>
        </DetailGroup>
        <Footer>
          <RecordIdentifier>F</RecordIdentifier>
          <NumberOfDetailRecords>11</NumberOfDetailRecords>
          <NumberOfQuantityRecords>9</NumberOfQuantityRecords>
          <DummyField/>
        </Footer>
      </rf:RefIntakeFF>
    </ri:RecRefineryFF_NLOperation>
  </soap12:Body>
</soap12:Envelope>
